 ## Introduction
 
    * Pandas is a library providing data structures and data analysis tools within Python.
    * Pandas allows you to load data from different sources into Python and then use Python code to analyse those data and produce data which can be in the form of tables, text and visualization.
    * Useful in processing data constructed of rows and columns.
    * Data Structure used in Pandas is called Data Frames.

In [1]:
import pandas

In [2]:
# Creating a data frame manually
df1 = pandas.DataFrame([[2,4,6],[10,20,30]])

In [3]:
df1

    0   1   2
0   2   4   6
1  10  20  30

In [4]:
# Giving some name to the columns in the Data Frame
df1 = pandas.DataFrame([[2,4,6],[10,20,30]],columns = ["Price","Age","Values"])

In [5]:
df1

   Price  Age  Values
0      2    4       6
1     10   20      30

In [6]:
# Giving some name to the rows in the Data Frame
df1 = pandas.DataFrame([[2,4,6],[10,20,30]], columns = ["Price","Age","Values"], index = ["First","Second"])

In [7]:
df1

        Price  Age  Values
First       2    4       6
Second     10   20      30

In [8]:
# Another way of creating manual Data Frames
df2 = pandas.DataFrame([{"Name":"John"},{"Name":"Jack"}])
df2

   Name
0  John
1  Jack

In [9]:
# Two key-value pair data in first row but only one in second. And hence in the output we can see NaN for the second row
df2 = pandas.DataFrame([{"Name":"John","Surname":"Jones"},{"Name":"Jack"}])
df2

   Name Surname
0  John   Jones
1  Jack     NaN

In [10]:
type(df1)

pandas.core.frame.DataFrame

In [11]:
# To find the mean of all the columns in the Data Frame
df1.mean()

Price      6.0
Age       12.0
Values    18.0
dtype: float64

In [12]:
# To find the mean of the entire Data Frame
df1.mean().mean()

12.0

In [13]:
type(df1.mean())

pandas.core.series.Series

In [14]:
df1.Price

First      2
Second    10
Name: Price, dtype: int64

In [15]:
type(df1.Price)

pandas.core.series.Series

A data Frame is made up of Series.

In [16]:
df1.Price.mean()

6.0

In [17]:
df1.Price.max()

10

In [18]:
import os
os.listdir()

['.ipynb_checkpoints',
 'PandasLibrary.ipynb',
 'supermarkets-commas.txt',
 'supermarkets-semi-colons.txt',
 'supermarkets.csv',
 'supermarkets.json',
 'supermarkets.xlsx']

In [19]:
# The function read_csv has a parameter 'header' which is set to true by default. This will consider the first row of the csv as the header of the table. 
# In case we don't want that, we can set it to False and it will treat the first row as normal data.
df_csv = pandas.read_csv("supermarkets.csv")
df_csv.set_index("ID")

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [20]:
df_csv.shape

(6, 7)

In [21]:
df_json = pandas.read_json("supermarkets.json")
df_json.set_index("ID")

,Address,City,Country,Employees,Name,State
ID,,,,,,
1,3666 21st St,San Francisco,USA,8,Madeira,CA 94114
2,735 Dolores St,San Francisco,USA,15,Bready Shop,CA 94119
3,332 Hill St,San Francisco,USA,25,Super River,California 94114
4,3995 23rd St,San Francisco,USA,10,Ben's Shop,CA 94114
5,1056 Sanchez St,San Francisco,USA,12,Sanchez,California
6,551 Alvarado St,San Francisco,USA,20,Richvalley,CA 94114

In [22]:
df_xlxs = pandas.read_excel("supermarkets.xlsx", sheet_name=0)
df_xlxs.set_index("ID")

,Address,City,State,Country,Supermarket Name,Number of Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [23]:
df_commas_text = pandas.read_csv("supermarkets-commas.txt")
df_commas_text.set_index("ID")

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [24]:
df_semi_colons_txt = pandas.read_csv("supermarkets-semi-colons.txt",sep=";")
df_semi_colons_txt

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [25]:
df_url_csv = pandas.read_csv("http://pythonhow.com/supermarkets.csv")
df_url_csv

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [26]:
df_url_json = pandas.read_json("http://pythonhow.com/supermarkets.json")
df_url_json

,Address,City,Country,Employees,ID,Name,State
0,3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
1,735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
2,332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3,3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
4,1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
5,551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [27]:
# Using a specific unique column as an index for indexing columns
df_url_json.set_index("Address")

,City,Country,Employees,ID,Name,State
Address,,,,,,
3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [28]:
# Original Data Frame is unchanged
df_url_json

,Address,City,Country,Employees,ID,Name,State
0,3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
1,735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
2,332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3,3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
4,1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
5,551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [29]:
df_url_json_upd = df_url_json.set_index("Address")

In [30]:
# Label indexing
# Can be put into a list using list() function
df_url_json_upd.loc["735 Dolores St":"332 Hill St","Country":"ID"]

               Country  Employees  ID
Address
735 Dolores St     USA         15   2
332 Hill St        USA         25   3

In [31]:
# Label indexing
df_url_json_upd.loc["735 Dolores St","Country"]

'USA'

In [32]:
# Position Based Indexing
df_url_json_upd.iloc[1:3,1:3]

               Country  Employees
Address
735 Dolores St     USA         15
332 Hill St        USA         25

In [33]:
# Combined Indexing
df_url_json_upd.ix[3,"Name"]

C:\Users\1022042\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

"Ben's Shop"

In [34]:
df_url_json_upd.ix[3,4]

C:\Users\1022042\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

"Ben's Shop"

In [35]:
# Deleting rows and columns
# The second argument tells whether to delete rows or columns
# 1 = Columns
# 2 = Rows
df_url_json_upd.drop("City",1)

                Country  Employees  ID         Name             State
Address
3666 21st St        USA          8   1      Madeira          CA 94114
735 Dolores St      USA         15   2  Bready Shop          CA 94119
332 Hill St         USA         25   3  Super River  California 94114
3995 23rd St        USA         10   4   Ben's Shop          CA 94114
1056 Sanchez St     USA         12   5      Sanchez        California
551 Alvarado St     USA         20   6   Richvalley          CA 94114

In [36]:
df_url_json_upd

,City,Country,Employees,ID,Name,State
Address,,,,,,
3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [37]:
df_url_json_upd.drop("332 Hill St",0)

                          City Country  Employees  ID         Name       State
Address
3666 21st St     San Francisco     USA          8   1      Madeira    CA 94114
735 Dolores St   San Francisco     USA         15   2  Bready Shop    CA 94119
3995 23rd St     San Francisco     USA         10   4   Ben's Shop    CA 94114
1056 Sanchez St  San Francisco     USA         12   5      Sanchez  California
551 Alvarado St  San Francisco     USA         20   6   Richvalley    CA 94114

In [38]:
df_url_json_upd.drop(df_url_json_upd.index[0:3],0)

                          City Country  Employees  ID        Name       State
Address
3995 23rd St     San Francisco     USA         10   4  Ben's Shop    CA 94114
1056 Sanchez St  San Francisco     USA         12   5     Sanchez  California
551 Alvarado St  San Francisco     USA         20   6  Richvalley    CA 94114

In [39]:
df_url_json_upd.drop(df_url_json_upd.columns[0:3],1)

                 ID         Name             State
Address
3666 21st St      1      Madeira          CA 94114
735 Dolores St    2  Bready Shop          CA 94119
332 Hill St       3  Super River  California 94114
3995 23rd St      4   Ben's Shop          CA 94114
1056 Sanchez St   5      Sanchez        California
551 Alvarado St   6   Richvalley          CA 94114

In [40]:
# Outputs Columns
df_url_json_upd.columns

Index(['City', 'Country', 'Employees', 'ID', 'Name', 'State'], dtype='object')

In [41]:
# Outputs Rows
df_url_json_upd.index

Index(['3666 21st St', '735 Dolores St', '332 Hill St', '3995 23rd St',
       '1056 Sanchez St', '551 Alvarado St'],
      dtype='object', name='Address')

In [42]:
# To find out the number of rows and columns in the data set
df_url_json_upd.shape

(6, 6)

In [43]:
df_url_json_upd

,City,Country,Employees,ID,Name,State
Address,,,,,,
3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114
735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119
332 Hill St,San Francisco,USA,25,3,Super River,California 94114
3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114
1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California
551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114

In [44]:
df_url_json_upd["Continent"] = ["North America"]

ValueError: Length of values does not match length of index

In [45]:
len(df_url_json_upd)

6

In the above example, we are creating a column and we need to pass values as a list to populate the data for that column. Now as we can see, we have 6 rows but we are trying to pass only a single value to it throught the list. Hence we are getiing the error "Length of values does not match length of index". So the solution is to pass the exact number of items that we have in our table in the data frame.

In [46]:
# Adding a column
# df_url_json_upd.shape[0] signifies the number of rows in the data frame
df_url_json_upd["Continent"] = df_url_json_upd.shape[0]*["North America"]

In [47]:
# The above command is an inplace operation and hence updates the data frame
df_url_json_upd

,City,Country,Employees,ID,Name,State,Continent
Address,,,,,,,
3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114,North America
735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119,North America
332 Hill St,San Francisco,USA,25,3,Super River,California 94114,North America
3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114,North America
1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California,North America
551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114,North America

In [48]:
df_url_json_upd.shape

(6, 7)

This implies we have 6 rows and 7 columns. The 0th index represents the number of rows and the 1st index represents the number of columns. shape() function returns a tuple.

In [49]:
# For modifying a column
df_url_json_upd["Continent"] = df_url_json_upd["Country"] + "," + " North America"
df_url_json_upd

,City,Country,Employees,ID,Name,State,Continent
Address,,,,,,,
3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114,"USA, North America"
735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119,"USA, North America"
332 Hill St,San Francisco,USA,25,3,Super River,California 94114,"USA, North America"
3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114,"USA, North America"
1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California,"USA, North America"
551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114,"USA, North America"

In [50]:
# Adding a new row
# Transpose of a data frame. Transforms the rows into columns and vice versa
df_url_json_upd_t = df_url_json_upd.T

In [51]:
df_url_json_upd_t

Address,3666 21st St,735 Dolores St,332 Hill St,3995 23rd St,1056 Sanchez St,551 Alvarado St
City,San Francisco,San Francisco,San Francisco,San Francisco,San Francisco,San Francisco
Country,USA,USA,USA,USA,USA,USA
Employees,8,15,25,10,12,20
ID,1,2,3,4,5,6
Name,Madeira,Bready Shop,Super River,Ben's Shop,Sanchez,Richvalley
State,CA 94114,CA 94119,California 94114,CA 94114,California,CA 94114
Continent,"USA, North America","USA, North America","USA, North America","USA, North America","USA, North America","USA, North America"

In [52]:
df_url_json_upd_t["My Address"] = ["My City","My Country",10,7,"My Shop", "My State","My Continent"]

In [53]:
df_url_json_upd = df_url_json_upd_t.T

In [54]:
df_url_json_upd

,City,Country,Employees,ID,Name,State,Continent
Address,,,,,,,
3666 21st St,San Francisco,USA,8,1,Madeira,CA 94114,"USA, North America"
735 Dolores St,San Francisco,USA,15,2,Bready Shop,CA 94119,"USA, North America"
332 Hill St,San Francisco,USA,25,3,Super River,California 94114,"USA, North America"
3995 23rd St,San Francisco,USA,10,4,Ben's Shop,CA 94114,"USA, North America"
1056 Sanchez St,San Francisco,USA,12,5,Sanchez,California,"USA, North America"
551 Alvarado St,San Francisco,USA,20,6,Richvalley,CA 94114,"USA, North America"
My Address,My City,My Country,10,7,My Shop,My State,My Continent